export const MAP = {
  width: 1060,
  height: 673.2,
  kmPerUnit: 4.547,
  pins: [
    { id: 'ams', lat: 52.3676, lon: 4.9041, x: 503.2, y: 120.6 },
    { id: 'sor', lat: 40.6263, lon: 14.3758, x: 661.3, y: 408.5 },
    { id: 'par', lat: 48.8566, lon: 2.3522, x: 456.7, y: 203.4 },
    { id: 'dol', lat: 46.45, lon: 11.85, x: 611, y: 267.8 },
    { id: 'mad', lat: 40.4168, lon: -3.7038, x: 325, y: 394.1 },
    { id: 'lan', lat: 29.03, lon: -13.63, x: 62.7, y: 622.9 },
    { id: 'col', lat: 50.9375, lon: 6.9603, x: 532.8, y: 157.3 },
    { id: 'kra', lat: 50.0647, lon: 19.945, x: 736.1, y: 170 },
    { id: 'wro', lat: 51.1079, lon: 17.0385, x: 688.4, y: 149.3 },
    { id: 'lvi', lat: 49.8397, lon: 24.0297, x: 800.7, y: 165.9 },
    { id: 'flo', lat: 43.7696, lon: 11.2558, x: 602, y: 333.5 },
    { id: 'rom', lat: 41.9028, lon: 12.4964, x: 625.4, y: 378.7 },
    { id: 'bcn', lat: 41.3874, lon: 2.1686, x: 436.1, y: 385.1 },
    { id: 'bol', lat: 49.067, lon: 23.864, x: 800, y: 179 },
    { id: 'dln', lat: 48.967, lon: 23.97, x: 805, y: 184 },
    { id: 'buk', lat: 48.359, lon: 24.409, x: 811, y: 201 },
    { id: 'ifr', lat: 48.9226, lon: 24.7111, x: 817, y: 187 },
    { id: 'ter', lat: 49.5535, lon: 25.5948, x: 825, y: 174 },
    { id: 'kry', lat: 47.9105, lon: 33.3918, x: 939, y: 185 },
    { id: 'kram', lat: 48.738, lon: 37.584, x: 1010, y: 148 },
    { id: 'sed', lat: 51.644, lon: 31.568, x: 908, y: 93 },
    { id: 'che', lat: 51.498, lon: 31.289, x: 901, y: 97 },
    { id: 'kyi', lat: 50.4501, lon: 30.5234, x: 912, y: 122 },
    { id: 'nur', lat: 49.4521, lon: 11.0767, x: 583, y: 184 },
    { id: 'ven', lat: 45.4408, lon: 12.3155, x: 625, y: 291 },
    { id: 'trn', lat: 42.5636, lon: 12.6427, x: 624, y: 358 },
    { id: 'ama', lat: 40.634, lon: 14.6027, x: 660, y: 411 },
    // { id: 'pom', lat: 40.7462, lon: 14.4989, x: 664, y: 402 },
    { id: 'mil', lat: 45.4642, lon: 9.19, x: 562, y: 295 },
    { id: 'com', lat: 46.016, lon: 9.257, x: 561, y: 285 },
  ],
  labels: [
    { text: 'АТЛАНТИЧНИЙ ОКЕАН', x: 129, y: 270, size: 15, kind: 'sea', rotation: 18.3 },
    { text: 'ПІВНІЧНЕ МОРЕ', x: 484.6, y: 36.5, size: 13, kind: 'sea', rotation: 4.3 },
    { text: 'СЕРЕДЗЕМНЕ МОРЕ', x: 697.2, y: 537.8, size: 15, kind: 'sea', rotation: -4.1 },
    { text: 'ВЕЛИКОБРИТАНІЯ', x: 398.8, y: 58.6, size: 12, kind: 'land', rotation: 7.2 },
    { text: 'ФРАНЦІЯ', x: 452.1, y: 260.9, size: 14, kind: 'land', rotation: 3.8 },
    { text: 'ІСПАНІЯ', x: 293.5, y: 441.4, size: 14, kind: 'land', rotation: 7.4 },
    { text: 'НІМЕЧЧИНА', x: 592.4, y: 173.8, size: 13, kind: 'land', rotation: -0.4 },
    { text: 'ПОЛЬЩА', x: 714.4, y: 109.7, size: 13, kind: 'land', rotation: -4.5 },
    { text: 'УКРАЇНА', x: 928.7, y: 168.1, size: 14, kind: 'land', rotation: -10.8 },
    { text: 'МАРОККО', x: 227.2, y: 598, size: 12, kind: 'land', rotation: 9.4 },
    { text: 'АЛЖИР', x: 429.8, y: 632.9, size: 13, kind: 'land', rotation: 4 },
    { text: 'РУМУНІЯ', x: 833.7, y: 257.9, size: 12, kind: 'land', rotation: -7.5 },
    { text: 'БІЛОРУСЬ', x: 844.7, y: 62.5, size: 12, kind: 'land', rotation: -9.1 },
  ],
};

export const PLACES = [
  { id: 'bol', name: 'Болехів', country: 'Україна', region: 'Івано-Франківська область', label: 'l', photo: './locations/bolekhiv.webp', note: 
    `Привіт моє кохання! 
    Це перший слайд мого привітання тебе з Днем Народження! 
    Воно у форматі міст, і тобі має сподобатись!
    І хочу я розпочати з міста Болехів! 
    Тут ми познайомились, тут Луна знайшла свій дім, тут розпочався наш шлях!`
   },
  { id: 'dln', name: 'Долина', country: 'Україна', region: 'Івано-Франківська область', label: 'r', photo: './locations/dolyna.webp', note: 
    `Але й Долину оминати не буду, адже найближчі тобі друзі походять звідси, Я і Луна!
    Та й радіо тут, що продукує свіженькі плітки, які ми так полюбляємо.`
   },
  { id: 'lvi', name: 'Львів', country: 'Україна', region: 'Львівська область', label: 'r', photo: './locations/lviv.webp', note: 
    `Славний Львів, сюди ми поїхали вперше, це місто у нас стоїть за ціль, 
    ми завжди прагнули сюди. І вже ось ось, ми вже майже тут.`
   },
  { id: 'buk', name: 'Буковель', country: 'Україна', region: 'Івано-Франківська область', label: 'b', approx: true, photo: './locations/bukovel.webp', note: 
    `А тут ми почали подорожувати, звісно не за кордон. Та для старту теж непогано. 
    Прогулянка з собаками по ліску, чаювання ввечері на альтанці окутані в пледі.`
   },
  { id: 'ifr', name: 'Івано-Франківськ', country: 'Україна', region: 'Івано-Франківська область', label: 'r', photo: './locations/ivanofrank.webp', note: 
    `Hard life досвід здається почався звідси. Було тяжко, відчуття було що ми на дні. 
    Роботи не було, крутіння та вертіння туди сюди не дуже давало приросту в грошах. 
    Тут ти тяжко працювала в Камеї, і неодноразово мені допомогла.`
   },
  { id: 'ter', name: 'Тернопіль', country: 'Україна', region: 'Тернопільська область', label: 'l', photo: './locations/ternopil.webp', note: 
    `Тернопіль зустрів нас під час війни. Звідси я вирушив на фронт. 
    Тут ми вперше побачились з тобою після того як я поїхав з Долини. 
    Була невизначеність, і я думав що стосункам кінець, але ні. 
    Ти показала мені що життєві складнощі не привід здаватись.`
   },
  { id: 'kry', name: 'Кривий Ріг', country: 'Україна', region: 'Дніпропетровська область', label: 'l', photo: './locations/kryvyirih.webp', note: 
    `Саме тут, на думку моїх батьків, ми почали "шикувати". 
    Але не будемо про них. Це місто пов'язало нас назавжди, тут ти сказала мені так, 
    тут ми бачились найчастіше. Лозунг Кривого Рогу - це місто довжиною в життя. Досить символічно, чи не так?`
   },
  { id: 'kram', name: 'Краматорськ', country: 'Україна', region: 'Донецька область', label: 'r', photo: './locations/kramatorsk.webp', note: 
    `Донецький останній рубіж, не дивлячись на небезпеку і близькість до фронту ти 
    неодноразово приїжджала сюди, просто щоб побачитись зі мною. Це великий прояв любові, я тобі дуже вдячний за це.`
   },
  { id: 'sed', name: 'Седнів', country: 'Україна', region: 'Чернігівська область', label: 't', approx: true, photo: './locations/sedniv.webp', note: 
    `Одне з місць де ти здобула новий досвід, покаталась на коні, і все ж. основна причина чому ти приїздила сюди, це щоб знову ми побачились.`
   },
  { id: 'che', name: 'Чернігів', country: 'Україна', region: 'Чернігівська область', label: 'l', photo: './locations/chernihiv.webp', note: 
    `Гарний і цікавий час був, чесно кажучи не знаю чи ми б колись поїхали сюди якби не моя служба, проте маємо чекпоінт.`
   },
  { id: 'kyi', name: 'Київ', country: 'Україна', region: 'Столиця України', label: 'r', photo: './locations/kyiv.webp', note: 
    `Пам'ятаєш як тут ми не потрапили в інстаграмний ресторан бо я був по формі? 
    Фактично це місто через яке лежали майже всі наші шляхи через Україну.`
   },
  { id: 'kra', name: 'Краків', country: 'Польща', region: 'Малопольське воєводство', label: 'b', photo: './locations/krakow.webp', note: 
    `Зустріч з Павлом, ми зупинились тут тільки по цій причині, але відкрили для себе непогане місто, 
    досить гарне і організоване. Чи тут ми прийняли рішення про спонтанні зупинки?`
   },
  { id: 'wro', name: 'Вроцлав', country: 'Польща', region: 'Нижньосілезьке воєводство', label: 'l', photo: './locations/wroclav.webp', note: 
    `Ох, нам просто не вистачало сил, і ми переночували і поснідали тут, проте це чудовий чекпоінт щоб не згадати його.`
   },
  { id: 'col', name: 'Кельн', country: 'Німеччина', region: 'Рейн · Північний Рейн-Вестфалія', label: 'l', photo: './locations/keln.webp', note: 
    `Наступна планова зупинка. Дуже чисте і охайне місто, шкода в собор не потрапили, зате поселення було прикольне. 
    Пам'ятаєш? Ми нікого не зустріли, ключ був в скринці.`
   },
  { id: 'ams', name: 'Амстердам', country: 'Нідерланди', region: 'Північна Голландія', label: 't', photo: './locations/amsterdam.webp', note: 
    `Гарно тут було, обов\'язково повернемось. Ти на парковці біля відділку який був навпроти нашого мотелю, розкурювала той легкий косяк, 
    який виніс мене за три тяги. Тебе теж тоді взяло!` },
  { id: 'par', name: 'Париж', country: 'Франція', region: 'Іль-де-Франс · столиця Франції', label: 'l', photo: './locations/paris.webp', note: 
    `Пам'ятаю того безхатька який казав тобі "Bonjur", а також як ми поламались тут! Це було якраз в 
    день коли ми планово мали відвідувати діснейленд, то була субота. Пам'ятаю подзвонив батькам, 
    вони тоді переконували що ми до понеділка не зможемо по-ремонтуватись. 
    Але ми знайшли деталь в неділю, більш того, якби батьки не допомогли з тим хто міг би по-ремонтувати авто, 
    я думаю ми однаково знайшли б вихід.`
   },
  { id: 'nur', name: 'Нюрнберг', country: 'Німеччина', region: 'Баварія', label: 'l', photo: './locations/nurnberg.webp', note: 
    `Тут ми придбали тобі адвент календар від рітуалс, а ще поліція пробачила нам що ми припаркувались на платному місці і не заплатили.`
   },
  { id: 'ven', name: 'Венеція', country: 'Італія', region: 'Венето', label: 'r', photo: './locations/venecia.webp', note: 
    `Наша перша зупинка в Італії, по суті саме звідси ми почали вивчати Італію. Було гарно, я проспорив 100 євро.`
   },
  { id: 'trn', name: 'Терні', country: 'Італія', region: 'Умбрія', label: 'l', photo: './locations/terni.webp', note: 
    `Пам'ятаєш як нас тут надурили з житлом? Це чудові відчуття коли ти так спонтанно зупиняєшся по дорозі, 
    особливо коли тебе намахують з житлом. Фото нема, тому просто фото з дороги.`
   },
  { id: 'sor', name: 'Соренто', country: 'Італія', region: 'Кампанія · Неаполітанська затока', label: 'l', photo: './locations/sorento.webp', note: 
    `Наша основна ціль поїздки, і це було справжнє кіно! Завданням тут було не тільки пляж знайти, а й вільне місце! Бо пляжів то й майже не було, одні скали.
    Але це найгарніші скали які я коли небудь бачив.`
   },
  { id: 'ama', name: 'Амалфі', country: 'Італія', region: 'Кампанія · Амальфітанське узбережжя', label: 'l', photo: './locations/amalfi.webp', note: 
    `А про це узбережжя ми здається дізнались коли вже поруч біля нього були. Саме ти й підказала про нього, це була неймовірна краса.`
   },
  // { id: 'pom', name: 'Помпеї', country: 'Італія', region: 'Кампанія · поблизу Неаполя', label: 'r', photo: '', note: 
  //   `Тут у нас був перекус у макдональці, по дорозі до Риму!`
  //  },
  { id: 'rom', name: 'Рим', country: 'Італія', region: 'Лаціо · столиця Італії', label: 'r', photo: './locations/rome.webp', note: 
    `Одне з тих місць куди ми маємо обов'язково повернутись, на це місто ми витратили день, а треба було цілих три, мінімум.`
   },
  { id: 'flo', name: 'Флоренція', country: 'Італія', region: 'Тоскана', label: 'l', photo: './locations/florence.webp', note: 
    `Пам'ятаєш ту чудову кіношну віллу по дорозі до статуї Давида? Я казав тобі що ми колись купимо її, досі маю це на меті.`
   },
  { id: 'mad', name: 'Мадрид', country: 'Іспанія', region: 'Столиця Іспанії', label: 'r', photo: './locations/madrid.webp', note: 
    `Цієї подорожі по суті розпочалось те без чого ця карта і не могла б існувати, а саме фотоапарат! 
    По задумці тут мали бути фото які ти зробила, але я не можу просто попросити в тебе фото, адже це мене видасть 
    із привітанням. Мадрид дуже гарний, і фотографувати тут було що, однозначно!`
   },
  { id: 'lan', name: 'Ланцароте', country: 'Іспанія', region: 'Канарські острови · вулканічний острів', label: 'r', approx: true, photo: './locations/lanzarote.webp', note: 
    `А цієї подорожі у нас змінились погляди на подорожі, тепер вони більш колоритніші і більш фіксовані ніж раніше! 
    Головне правило, зупинись і насолодись, але й не тормози)`
   },
  { id: 'bcn', name: 'Барселона', country: 'Іспанія', region: 'Каталонія', label: 'r', photo: './locations/barcelona.webp', note: 
    `Головна пам'ятка цього міста зустріла нас рясною зливою, але тут в макдональці ми знайшли бутилочку іншого кольору!`
   },
  { id: 'mil', name: 'Мілан', country: 'Італія', region: 'Ломбардія', label: 'l', photo: './locations/milan.webp', note: 
    `Чесно кажучи, не встигли вивчити і насолодитись, може ще якось повернемось? `
   },
  { id: 'com', name: 'Озеро Комо', country: 'Італія', region: 'Ломбардія · передгір’я Альп', label: 't', approx: true, photo: './locations/komo.webp', note: 
    `Звідси розпочинається мрія про човник і дім на озері Комо. Сподіваюсь це у нас спільне. Одне з найгарніших місць побачених мною. 
    Радий, що побував тут з тобою!`
   },
  { id: 'dol', name: 'Доломіти', country: 'Італія', region: 'Східні Альпи', label: 'r', approx: true, photo: './locations/dolomity.webp', note: 
    `Дуже величні гори, хоч і фотки вийшли розмиті, але я б навіть знаючи це, все одно поїхав б сюди. 
    До чого ж були ці всі згадки? І в радості і в горі, ми з тобою багато чого пройшли, 
    наш шлях вже дуже немаленький, і за майже сім років ми багато встигли! Але маємо встигнути ще набагато більше, е-геж? 
    Здається в гонитві за бажаним ми не встигли помітити скільки всього вже набули, але не варто зупинятись! 
    Я дуже вдячний тобі за те, що ти з'явилась в моєму житті, ти мій рух, мій стимул, двигун прогресу, з тобою мрії збуваються. 
    Люблю тебе безмежно! З днем народження!`
   },
];

export const PLACE_LABELS = {
  r: [14, 4.5, 'start'],
  l: [-14, 4.5, 'end'],
  t: [0, -15, 'middle'],
  b: [0, 26, 'middle'],
};
